[
  {
    "year": "1945",
    "type": "political",
    "en": "Ho Chi Minh declares Vietnam’s independence.",
    "vi": "Hồ Chí Minh tuyên bố độc lập của Việt Nam."
  },
  {
    "year": "1954",
    "type": "battle",
    "en": "Battle of Dien Bien Phu defeats French forces.",
    "vi": "Trận Điện Biên Phủ đánh bại quân đội Pháp."
  },
  {
    "year": "1954",
    "type": "political",
    "en": "Geneva Accords divide Vietnam at the 17th parallel.",
    "vi": "Hiệp định Genève chia Việt Nam tại vĩ tuyến 17."
  },
  {
    "year": "1962",
    "type": "tech-weapons",
    "en": "UH-1 Huey helicopters introduced, revolutionizing air mobility.",
    "vi": "Trực thăng UH-1 Huey được đưa vào sử dụng, thay đổi chiến thuật cơ động đường không."
  },
  {
    "year": "1964",
    "type": "us-escalation",
    "en": "Gulf of Tonkin incident escalates US involvement.",
    "vi": "Sự kiện Vịnh Bắc Bộ khiến Mỹ leo thang tham chiến."
  },
  {
    "year": "1965",
    "type": "us-escalation",
    "en": "US combat troops arrive in Vietnam.",
    "vi": "Quân chiến đấu Mỹ đổ bộ vào Việt Nam."
  },
  {
    "year": "1965",
    "type": "tech-weapons",
    "en": "M113 Armored Personnel Carriers used extensively in jungle warfare.",
    "vi": "Xe bọc thép M113 được sử dụng rộng rãi trong chiến tranh rừng rậm."
  },
  {
    "year": "1966",
    "type": "tech-weapons",
    "en": "M48 Patton tanks deployed by US and ARVN forces.",
    "vi": "Xe tăng M48 Patton được quân đội Mỹ và VNCH triển khai."
  },
  {
    "year": "1967",
    "type": "tech-weapons",
    "en": "AK-47 rifles become standard weapon for North Vietnamese forces.",
    "vi": "Súng AK-47 trở thành vũ khí tiêu chuẩn của quân đội Bắc Việt."
  },
  {
    "year": "1967",
    "type": "tech-weapons",
    "en": "B-52 Stratofortress used for large-scale bombing operations.",
    "vi": "Máy bay B-52 được sử dụng cho các chiến dịch ném bom quy mô lớn."
  },
  {
    "year": "1968",
    "type": "battle",
    "en": "Tet Offensive becomes a turning point in the war.",
    "vi": "Tổng tiến công Tết trở thành bước ngoặt của chiến tranh."
  },
  {
    "year": "1968",
    "type": "tech-weapons",
    "en": "M16 rifle fully replaces earlier US infantry weapons.",
    "v
