[
  {
    "year": "1945",
    "type": "analysis",
    "en": "REPORT: The Technocratic Tragedy - Strategy & Limits of Power",
    "vi": "BÁO CÁO: Bi kịch Kỹ trị - Chiến lược & Giới hạn Quyền lực",
    "link": "https://nguydan.github.io/Vietnam-war-history/technocratic-tragedy.html",
    "video": "https://www.youtube.com/embed/9-I6wcRwnfE"
  },
  {
    "year": "1945",
    "type": "political",
    "en": "Ho Chi Minh declares Vietnam's independence in Ba Dinh Square, Hanoi.",
    "vi": "Hồ Chí Minh tuyên bố độc lập của Việt Nam tại Quảng trường Ba Đình, Hà Nội.",
    "video": "https://www.youtube.com/embed/ZbIsIUAzBcs"
  },
  {
    "year": "1954",
    "type": "battle",
    "en": "The Fall of Dien Bien Phu ends French colonial rule in Indochina.",
    "vi": "Sự sụp đổ của Điện Biên Phủ chấm dứt chế độ thuộc địa Pháp tại Đông Dương.",
    "video": "https://www.youtube.com/embed/StLAs7S-_cs"
  },
  {
    "year": "1954",
    "type": "political",
    "en": "The Geneva Accords temporarily divide Vietnam at the 17th parallel.",
    "vi": "Hiệp định Genève tạm thời chia Việt Nam tại vĩ tuyến 17."
  },
  {
    "year": "1954–1963",
    "type": "political",
    "en": "South Vietnam faces political instability, religious repression, and corruption under Ngo Dinh Diem, culminating in his assassination in 1963.",
    "vi": "Miền Nam Việt Nam đối mặt với bất ổn chính trị, đàn áp tôn giáo và tham nhũng dưới chế độ Ngô Đình Diệm, kết thúc bằng vụ ám sát ông năm 1963."
  },
  {
    "year": "1962",
    "type": "tech-weapons",
    "en": "The UH-1 Huey ushers in a new era of air mobility and helicopter warfare.",
    "vi": "Trực thăng UH-1 Huey mở ra kỷ nguyên mới của cơ động đường không và chiến tranh trực thăng.",
    "video": "https://www.youtube.com/embed/gWXEGUctKXw"
  },
  {
    "year": "1963",
    "type": "political",
    "en": "The Buddhist Crisis intensifies opposition to Ngo Dinh Diem's regime.",
    "vi": "Khủng hoảng Phật giáo làm gia tăng phản đối chế độ Ngô Đình Diệm."
  },
  {
    "year": "1964",
    "type": "political",
    "en": "The Gulf of Tonkin Resolution grants President Johnson broad authority to expand U.S. military involvement.",
    "vi": "Nghị quyết Vịnh Bắc Bộ trao cho Tổng thống Johnson quyền rộng rãi để mở rộng can thiệp quân sự của Mỹ."
  },
  {
    "year": "1965",
    "type": "battle",
    "en": "U.S. combat troops arrive in Da Nang, marking the beginning of large-scale ground war.",
    "vi": "Quân chiến đấu Mỹ đổ bộ vào Đà Nẵng, đánh dấu sự khởi đầu của chiến tranh trên bộ quy mô lớn."
  },
  {
    "year": "1968",
    "type": "battle",
    "en": "ARVN forces defend Saigon during the Tet Offensive.",
    "vi": "Quân lực VNCH phòng thủ Sài Gòn trong Tết Mậu Thân.",
    "video": "https://www.youtube.com/embed/GEstlzhY5_s"
  },
  {
    "year": "1968",
    "type": "battle",
    "en": "The Tet Offensive becomes a strategic turning point in public opinion.",
    "vi": "Cuộc Tổng tiến công Tết trở thành bước ngoặt chiến lược về mặt dư luận."
  },
  {
    "year": "1968",
    "type": "political",
    "en": "The My Lai Massacre shocks the American public and fuels anti-war protests.",
    "vi": "Thảm sát Mỹ Lai gây chấn động dư luận Mỹ và thúc đẩy phong trào phản chiến."
  },
  {
    "year": "1969–1973",
    "type": "political",
    "en": "Vietnamization shifts combat responsibility to South Vietnamese forces while U.S. troops gradually withdraw.",
    "vi": "Chiến lược Vietnamization chuyển giao trách nhiệm chiến đấu cho lực lượng VNCH trong khi quân Mỹ rút dần."
  },
  {
    "year": "1972",
    "type": "battle",
    "en": "The North Vietnamese Easter Offensive tests the success of Vietnamization.",
    "vi": "Cuộc Tổng tấn công mùa Xuân 1972 thử thách hiệu quả của chiến lược Vietnamization."
  },
  {
    "year": "1973",
    "type": "political",
    "en": "The Paris Peace Accords formally end U.S. military involvement, though fighting continues.",
    "vi": "Hiệp định Paris chính thức chấm dứt sự tham chiến của Mỹ, nhưng xung đột vẫn tiếp diễn."
  },
  {
  "year": "1975",
  "en": "The Fall of Saigon on April 30 marks the end of the Vietnam War.",
  "vi": "Sự kiện 30 tháng 4 đánh dấu sự kết thúc của Chiến tranh Việt Nam.",
  "type": "political",
  "video": "https://www.youtube.com/embed/Ssh8K_7Xp_g"
  }
]